
#include <iostream>

int main()
{

  setlocale(LC_ALL, "RUS" );

  std::cout << "t\t\tДеление  числа на разряды \n\n";
  int a;
  std::cout << "Ведите  пятизначное число : ";

  std::cin >> a;

  std::cout <<"\n";
  if (a >= 0&&a <=9999 )
  {
    std::cout << "вы ввели неверное число. Число должно быть  пятизначным \n\n";
  }
  else {
    if (a>= 100000)
    {
      std::cout << "вы ввели неверное число. Число должно быть  пятизначным \n\n";
    }
  else {
      std::cout << "1 цифра равна : " << (a/10000)<<"\n";
      std::cout << "2 цифра равна : " << (a/1000)%10<<"\n";
      std::cout << "3 цифра равна : " << (a/100)%10<<"\n";
      std::cout << "2 цифра равна : " << (a/10)%10<<"\n";
      std::cout << "2 цифра равна : " << a%10<<"\n";
      
      std::cout << std::endl;
      return  0;
  }
  }

}